# 一、运算符(优先级: 算术运算符 > 比较运算符 > 逻辑运算符（not > and > or） > 赋值运算符)
#
# 1、算术运算符（优先级：幂指数 > 乘除余 > 加减）
#   +加、-减、*乘、/除（小数类型）、//整除、%求余数、**求幂指数
#
# 2、赋值运算符
#     a = 3
#     a += 5  # a= a+5 = 8
#
# 3、比较运算符
#     >大于   <小于    >=大于等于    <=小于等于   ==等于    !=不等于
#
# 4、逻辑运算符
#     and逻辑与(全真为真,有假即假);  or逻辑或(有真即真,全假为假);  not逻辑取反(取反)



# 算术运算符
# print(1 + 2)
# print(1 - 2)
# print(3 * 4)
# print(10 / 3)  #结果为浮点数类型即小数
# print(10 // 3 )  #整除
# print(10 % 3 )  #求余数
# print(2 ** 3)   #幂指数

#赋值运算符
a = 3
a += 5  # a= a+5 = 8
print(a)

#逻辑运算符
result = 3 > 5 and 6 < 3

